my_string=input("ваш город проживания: ") #-для ввода данных пользователем.
print(len(my_string))                      #-кол_во символов введенного текста.
print(my_string[0])              #-индексацию используем д/вывода частей или символа строки.
print(my_string[-1])             #-индексацию используем д/вывода частей или символа строки.
my_string=('ваш город проживания')
print(my_string .upper())   #- функция для верхнего регистра.
print(my_string .lower())    #- функция для нижнего регистра.
print(my_string .replace(' ',''))    #- метод для замены символов.

